[{"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"title": "NASA Wins 4 Webbys, 4 People's Voice Awards", "preview": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."}, {"title": "Alabama High School Student Names NASA's Mars Helicopter", "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"title": "NASA's New Mars Rover Is Ready for Space Lasers", "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "NASA's Mars 2020 Rover Closer to Getting Its Name", "preview": "155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."}, {"title": "InSight's 'Mole' Team Peers into the Pit", "preview": "Efforts to save the heat probe continue."}, {"title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"title": "From JPL's Mailroom to Mars and Beyond", "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "preview": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"title": "NASA's Perseverance Rover Is Midway to Mars ", "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}]